perf_test/results/create_report_iter1.txt
Requests      [total, rate, throughput]         100000, 500.00, 499.99
Duration      [total, attack, wait]             3m20s, 3m20s, 3.863ms
Latencies     [min, mean, 50, 90, 95, 99, max]  2.017ms, 4.46ms, 3.527ms, 7.234ms, 11.919ms, 15.013ms, 157.203ms
Bytes In      [total, mean]                     61684327, 616.84
Bytes Out     [total, mean]                     36296493, 362.96
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:100000  
Error Set: