perf_test/results/read_report.txt
Requests      [total, rate, throughput]         30000, 1000.01, 982.41
Duration      [total, attack, wait]             30.001s, 30s, 949.318µs
Latencies     [min, mean, 50, 90, 95, 99, max]  517.332µs, 1.085ms, 1.041ms, 1.414ms, 1.511ms, 1.777ms, 3.971ms
Bytes In      [total, mean]                     18175411, 605.85
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           98.24%
Status Codes  [code:count]                      200:29473  403:5  404:522  
Error Set:
404 Not Found
403 Forbidden