perf_test/results/read_report_12000.txt
Requests      [total, rate, throughput]         41874, 2524.29, 68.89
Duration      [total, attack, wait]             21.674s, 16.588s, 5.085s
Latencies     [min, mean, 50, 90, 95, 99, max]  1.232ms, 5.197s, 5.566s, 10.091s, 10.836s, 13.296s, 18.66s
Bytes In      [total, mean]                     923838, 22.06
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           3.57%
Status Codes  [code:count]                      0:40352  200:1493  404:29  
Error Set:
Get "http://localhost:8083/v1/posts/51634": dial tcp 0.0.0.0:0->127.0.0.1:8083: bind: address already in use
Get "http://localhost:8083/v1/posts/37498": read tcp 127.0.0.1:39343->127.0.0.1:8083: read: connection reset by peer
Get "http://localhost:8083/v1/posts/20116": read tcp 127.0.0.1:47771->127.0.0.1:8083: read: connection reset by peer
Get "http://localhost:8083/v1/posts/7566": read tcp 127.0.0.1:59425->127.0.0.1:8083: read: connection reset by peer
Get "http://localhost:8083/v1/posts/21053": dial tcp 0.0.0.0:0->127.0.0.1:8083: bind: address already in use
Get "http://localhost:8083/v1/posts/65009": dial tcp 0.0.0.0:0->127.0.0.1:8083: bind: address already in use