perf_test/results/read_report_4000.txt
Requests      [total, rate, throughput]         59999, 4000.13, 3929.34
Duration      [total, attack, wait]             15s, 14.999s, 708.574µs
Latencies     [min, mean, 50, 90, 95, 99, max]  492.323µs, 876.066µs, 807.504µs, 988.045µs, 1.104ms, 1.695ms, 26.698ms
Bytes In      [total, mean]                     36345410, 605.77
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           98.23%
Status Codes  [code:count]                      200:58940  403:9  404:1050  
Error Set:
404 Not Found
403 Forbidden