perf_test/results/read_report_8000.txt
Requests      [total, rate, throughput]         55958, 3554.65, 2990.94
Duration      [total, attack, wait]             16.783s, 15.742s, 1.041s
Latencies     [min, mean, 50, 90, 95, 99, max]  2.73ms, 4.245s, 4.565s, 8.52s, 9.173s, 9.966s, 11.995s
Bytes In      [total, mean]                     30959569, 553.26
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           89.71%
Status Codes  [code:count]                      0:4870  200:50198  403:6  404:884  
Error Set:
404 Not Found
403 Forbidden
Get "http://localhost:8083/v1/posts/65927": read tcp 127.0.0.1:41975->127.0.0.1:8083: read: connection reset by peer
Get "http://localhost:8083/v1/posts/96314": read tcp 127.0.0.1:42007->127.0.0.1:8083: read: connection reset by peer
Get "http://localhost:8083/v1/posts/30530": dial tcp 0.0.0.0:0->127.0.0.1:8083: bind: address already in use
Get "http://localhost:8083/v1/posts/97563": dial tcp 0.0.0.0:0->127.0.0.1:8083: bind: address already in use